<?php

/*
Variable ဆိုတာကတော့ value တွေကိုထည့်သွင်းတဲ့ container ပါပဲ။
ဥပမာ ကျွန်တော်တို့အနေနဲ့ ရေဖန်ခွက်တစ်ခုရဖို့အတွက် ဖန်ခွက်ထဲကို ရေထည့်လိုက်တယ် ဆိုပါစို့။
အဲဒီအခါမှာ ဖန်ခွက် ဆိုတဲ့ container ထဲကို ရေ ဆိုတဲ့တန်ဖိုးကို ထည့်လိုက်တော့ အဲဒီဖန်ခွက်သည် ရေထည့်ထားတဲ့ ဖန်ခွက် ဖြစ်သွားပါတယ်။
ဒီလိုပါပဲ 1 ဆိုတဲ့ value ကို $var1 ထဲကို ထည့်သွင်းလိုက်တယ်ဆိုရင် $var1 ဆိုတဲ့ container ထဲကို 1 ဆိုတဲ့ value ရောက်သွားပါပြီ။
ဒီတော့ $var1 = 1 ဆိုပြီး ကြေငြာလိုက်ခြင်းအားဖြင့် $var1 သည် 1 ဆိုတဲ့ value ကို ထည့်သွင်းထားသော container ဖြစ်တယ်ဆိုတာကို ကြေငြာပြီးသား ဖြစ်သွားပါတယ်။
*/

//Following one is the String
$var1 = "This is the String";

//Following one is the Integer
$var2 = 2;

//Following one is the Floats
$var3 = 1.2345;

echo $var1."<br />".$var2. "<br />".$var3;

/*
အပေါ်က ဥပမာအရဆိုရင် = ဆိုတဲ့ assignment operator ကို သုံးပြီးတော့ This is the String ဆိုတဲ့ value ကို $var1 မှာသွားထည့်ပြီးတော့ 2 ဆိုတဲ့ value ကို $var2 မှာ သွားထည့်ထားပြီး 1.2345 ဆိုတဲ့ value ကိုတော့ $var3 မှာ သွားထည့်ထားတာကို တွေ့ရလိမ့်မယ်
အဲဒီမှာ variable တွေထဲကို ထည့်လိုက်တဲ့ data အမျိုးအစားပေါ်မူတည်ပြီးတော့ variable type တွေကလည်း မတူညီကြတာကို တွေ့ရပါလိမ့်မယ်
*/

?>
