<?php
/*
This is the basic of Integers
ဒီဥပမာအရဆိုရင် $var1 ကို 1 လို့ကြေငြာပြီး $var2 ကိုတော့ 2 လို့ ကြေငြာထားပါတယ်။
အခုဥပမာက integer ကို ကြေငြာတဲ့ဥပမာသာဖြစ်လို့ သူတို့နှစ်ခုပေါင်းလဒ်ဖြစ်မဲ့ 5 ကိုတော့ တကယ် calculate မလုပ်ပဲနဲ့ $var3 အနေနဲ့ ကြေငြာထားတာကို တွေ့ရပါလိမ့်မယ်။
အဲဒီမှာ ခုနက strings နဲ့ ကြေငြာသွားပုံချင်း မတူတာက string ရဲ့ value တွေရဖို့အတွက် " ရဲ့ အဖွင့်နဲ့ အပိတ်ကြားထဲမှာ ထည့်ပေးရပေမဲ့ ဒီလို integer ကြေငြာရာမှာတော့ " ကို သုံးစရာ မလိုတော့ပါဘူး။
တကယ်လို့များ " ထဲမှာကြေငြာလိုက်ရင် သူဟာ strings ဖြစ်သွားပါလိမ့်မယ်။
*/
$var1 = 1;
$var2 = 2;
$var3 = 5;
$var4 = "6";
echo "When adding"."\t".$var1."\t"."&"."\t".$var2."\t".", the result is"."\t".$var3;
/*
to check the variable type
*/
//echo gettype ( $var4 );
?>
